tsung/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/local/share/tsung/tsung-1.0.dtd">


<tsung loglevel="debug" dumptraffic="false" version="1.0">

<clients>
  <client host="localhost" use_controller_vm="true"/>
</clients>

<!-- Server side setup -->
<servers>
  <server host="10.55.4.105" port="80" type="tcp"></server>
</servers>

<load>
  <!-- several arrival phases can be set: for each phase, you can set the mean inter-arrival time between new clients and the phaseduration -->
  <arrivalphase phase="1" duration="15" unit="second">
    <users interarrival="1" unit="second"></users>
  </arrivalphase>
  <arrivalphase phase="2" duration="30" unit="second">
    <users interarrival="0.125" unit="second"></users>
  </arrivalphase>
  <arrivalphase phase="3" duration="25" unit="second">
    <users interarrival="1" unit="second"></users>
  </arrivalphase>
  <user session="rec20100828-02:31" start_time="0" unit="second"></user>
</load>


<sessions>
  <session name='rec20100828-02:31' probability='100'  type='ts_http'>

	<request><http url='/' version='1.1' method='GET'></http></request>
	<thinktime random='true' value='1'/>
	<request><http url='/?p=176' version='1.1' method='GET'></http></request>
	<thinktime random='true' value='4'/>
	<request><http url='/?m=200801' version='1.1' method='GET'></http></request>
	<thinktime random='true' value='4'/>
	<request><http url='/?p=152' version='1.1' method='GET'></http></request>
	<thinktime random='true' value='10'/>
	<request><http url='/?m=200703' version='1.1' method='GET'></http></request>
	<thinktime random='true' value='2'/>
	<request><http url='/' version='1.1' method='GET'></http></request>
	<request><http url='/?p=1' version='1.1' method='GET'></http></request>
  </session>
</sessions>

</tsung>